export const jsdata = `1,大平麻耶,オオヒラマヤ,0845422538,730-0832,広島県,広島市中区,江波東,3-8-7,江波東ハウス417,1965/02/13
2,倉持朱莉,クラモチアカリ,0985988478,901-1514,沖縄県,南城市,知念具志堅,3-11-3,ハウス知念具志堅309,1992/04/15
3,新保勝一,シンポカツイチ,0193554473,028-7602,岩手県,八幡平市,丑山,3-15-19,,1991/06/29
4,河井希子,カワイキコ,0870857047,760-0048,香川県,高松市,福田町,3-2-14,,1990/05/03
5,木原安,キハラヤスシ,0187749744,018-0433,秋田県,にかほ市,畑,4-15-5,,1990/01/11
6,今野秋友,コンノアキトモ,098276171,880-0938,宮崎県,宮崎市,京塚町,2-5-2,,1984/11/13
7,中根昭子,ナカネアキコ,0988537081,905-1308,沖縄県,国頭郡大宜味村,上原,4-18-8,,1998/08/19
8,菅英実,カンヒデミ,0528193477,492-8072,愛知県,稲沢市,下津北信正寺町,1-19,下津北信正寺町庵216,1973/03/03
9,佐竹唯花,サタケユイカ,0785201841,672-8039,兵庫県,姫路市,飾磨区阿成渡場,4-1,,1994/06/18
10,平川澄子,ヒラカワスミコ,0745838406,632-0241,奈良県,奈良市,都祁南之庄町,1-10-20,ヴィレッジ都祁南之庄町411,1975/04/04
11,塩谷政昭,シオタニマサアキ,0763041622,937-0814,富山県,魚津市,石垣,4-11-7,,1971/05/30
12,倉橋佐一,クラハシサイチ,0869575518,713-8122,岡山県,倉敷市,玉島中央町,4-1-15,,1970/07/23
13,遠山義雄,トオヤマヨシオ,0265484882,384-0048,長野県,小諸市,糠地,1-6,,1999/05/25
14,平山幸子,ヒラヤマサチコ,0865349017,700-0831,岡山県,岡山市北区,京橋町,1-15,テラス京橋町215,1972/03/10
15,村木萌衣,ムラキメイ,0998446846,899-6103,鹿児島県,姶良郡湧水町,川添,1-3-11,,1967/06/07
16,藤巻伸夫,フジマキノブオ,0282667738,321-2522,栃木県,日光市,鬼怒川温泉大原,2-5,,1996/04/01
17,神山茂男,カミヤマシゲオ,0880150424,779-3505,徳島県,吉野川市,美郷来見坂,3-16-4,,1968/12/29
18,高松由真,タカマツユマ,0892796081,791-1125,愛媛県,松山市,小村町,3-15-13,,1979/11/12
19,島宏明,シマヒロアキ,0744904127,639-0217,奈良県,北葛城郡上牧町,中筋出作,2-12-10,,2000/04/17
20,東耕筰,アズマコウサク,026032992,382-0037,長野県,須坂市,野辺町,1-20-19,,1971/05/17
21,大木彩加,オオキアヤカ,0199177669,025-0251,岩手県,花巻市,豊沢,4-3,,1973/05/12
22,沢井比呂,サワイヒロ,0873430294,764-0021,香川県,仲多度郡多度津町,堀江,4-12-12,,1984/06/20
23,高尾國吉,タカオクニヨシ,0456514233,221-0834,神奈川県,横浜市神奈川区,台町,3-6-15,台町テラス416,1979/07/23
24,安永隆明,ヤスナガタカアキ,0779915574,606-8314,京都府,京都市左京区,吉田下大路町,4-8,吉田下大路町シティ418,1965/11/03
25,白井純奈,シライジュンナ,0238921813,997-0029,山形県,鶴岡市,日吉町,2-10,,1989/07/03
26,湯川洋臣,ユカワヒロオミ,0763711976,920-0866,石川県,金沢市,中央通町,2-12,,2002/10/01
27,葛西俊雄,カサイトシオ,0458144556,220-0041,神奈川県,横浜市西区,戸部本町,2-3-12,リバーサイド戸部本町208,1993/08/09
28,榊原和人,サカキバラカズト,0293304556,314-0003,茨城県,鹿嶋市,小宮作,4-3,小宮作レジデンス415,1984/06/26
29,望月裕史,モチヅキヒロシ,02524384,949-1722,新潟県,上越市,西山寺,1-20-10,西山寺パーク110,2002/06/03
30,森本涼,モリモトリョウ,0589112306,505-0113,岐阜県,可児郡御嵩町,宿,1-3-9,,1973/08/13
31,石本国男,イシモトクニオ,0282854995,321-2101,栃木県,宇都宮市,飯山町,2-13-17,,1988/02/08
32,岡村好夫,オカムラヨシオ,0868534694,701-2446,岡山県,赤磐市,小鎌,2-20-9,ロイヤルパレス小鎌410,1987/03/23
33,堀越基之,ホリコシモトユキ,0791205022,656-2212,兵庫県,淡路市,佐野,4-8-16,,2001/07/11
34,市村舞香,イチムラマイカ,0822526992,736-0004,広島県,安芸郡海田町,石原,4-8-1,,1995/07/30
35,江崎紅葉,エザキクレハ,0748720935,527-0005,滋賀県,東近江市,建部南町,4-12-10,,1984/09/11
36,李直道,リタダミチ,0260778361,397-0002,長野県,木曽郡木曽町,新開,2-14-12,,1976/05/24
37,宍戸胡桃,シシドクルミ,0836450856,747-0023,山口県,防府市,多々良,3-6-9,多々良庵201,1975/08/04
38,浦野基一,ウラノキイチ,0740481767,527-0036,滋賀県,東近江市,聖和町,4-7,,1991/09/17
39,鶴岡空澄,ツルオカアスミ,046413316,355-0325,埼玉県,比企郡小川町,上古寺,2-12,上古寺シーサイド410,1994/07/08
40,加藤香乃,カトウカノ,0244630357,971-8131,福島県,いわき市,常磐上矢田町,1-17-20,,1972/12/30
41,早川璃音,ハヤカワリオン,0471280464,356-0043,埼玉県,ふじみ野市,緑ケ丘,4-20-12,,1974/04/05
42,横溝年昭,ヨコミゾトシアキ,076231873,922-0673,石川県,加賀市,塩屋町,3-15,塩屋町スカイ115,1980/01/02
43,小椋岩夫,オグライワオ,0887501887,779-0108,徳島県,板野郡板野町,犬伏,3-16,,1968/12/23
44,福山一弘,フクヤマカズヒロ,0761554896,929-0107,石川県,能美市,福岡町,3-8-18,,1967/08/18
45,杉原賢次,スギハラケンジ,0138853620,098-4122,北海道,天塩郡豊富町,東二条,2-18-11,,1990/07/29
46,塚原当麻,ツカハラトウマ,0586676343,492-8155,愛知県,稲沢市,井之口四家町,3-14-19,,1970/11/10
47,守屋真紀子,モリヤマキコ,0408202958,352-0001,埼玉県,新座市,東北,2-19,東北ゴールデン418,1984/06/20
48,伴友治,バントモジ,017949671,039-2875,青森県,上北郡七戸町,淋代,1-18-13,淋代プレイス113,1964/11/28
49,三島陽子,ミシマヨウコ,0295795828,308-0017,茨城県,筑西市,上中山,3-6-20,,1964/10/06
50,井川信次,イカワシンジ,0968244273,868-0821,熊本県,人吉市,上漆田町,4-12-7,,1977/09/02`;

export function convertCSVtoArray(jsdata) {
  // 読み込んだCSVデータが文字列として渡される
  var result = []; // 最終的な二次元配列を入れるための配列
  var tmp = jsdata.split('\n'); // 改行を区切り文字として行を要素とした配列を生成

  // 各行ごとにカンマで区切った文字列を要素とした二次元配列を生成
  for (var i = 0; i < tmp.length; ++i) {
    result[i] = tmp[i].split(',');
  }
  return result;
}
